#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.training-cluster.data.kubernetes_service.ingress-nginx will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "kubernetes_service" "ingress-nginx" {
      + id     = (known after apply)
      + spec   = (known after apply)
      + status = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "ingress-nginx-controller"
          + namespace        = "ingress-nginx"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.training-cluster.hcloud_firewall.firewall will be created
  + resource "hcloud_firewall" "firewall" {
      + id     = (known after apply)
      + labels = (known after apply)
      + name   = "k8s-cluster-test"

      + apply_to {
          + label_selector = "cluster=test"
          + server         = (known after apply)
        }

      + rule {
          + destination_ips = []
          + direction       = "in"
          + port            = "22"
          + protocol        = "tcp"
          + source_ips      = [
              + "0.0.0.0/0",
              + "::/0",
            ]
        }
      + rule {
          + destination_ips = []
          + direction       = "in"
          + port            = "9345"
          + protocol        = "tcp"
          + source_ips      = (known after apply)
        }
    }

  # module.training-cluster.hcloud_load_balancer.lb will be created
  + resource "hcloud_load_balancer" "lb" {
      + delete_protection  = false
      + id                 = (known after apply)
      + ipv4               = (known after apply)
      + ipv6               = (known after apply)
      + labels             = {
          + "cluster" = "test"
        }
      + load_balancer_type = "lb11"
      + location           = "nbg1"
      + name               = "lb-k8s-test"
      + network_id         = (known after apply)
      + network_ip         = (known after apply)
      + network_zone       = (known after apply)
    }

  # module.training-cluster.hcloud_load_balancer_network.lb will be created
  + resource "hcloud_load_balancer_network" "lb" {
      + enable_public_interface = true
      + id                      = (known after apply)
      + ip                      = "10.0.0.2"
      + load_balancer_id        = (known after apply)
      + network_id              = (known after apply)
    }

  # module.training-cluster.hcloud_load_balancer_service.api will be created
  + resource "hcloud_load_balancer_service" "api" {
      + destination_port = 6443
      + id               = (known after apply)
      + listen_port      = 6443
      + load_balancer_id = (known after apply)
      + protocol         = "tcp"
      + proxyprotocol    = (known after apply)

      + health_check {
          + interval = 5
          + port     = 6443
          + protocol = "tcp"
          + retries  = 2
          + timeout  = 2
        }
    }

  # module.training-cluster.hcloud_load_balancer_service.rke2 will be created
  + resource "hcloud_load_balancer_service" "rke2" {
      + destination_port = 9345
      + id               = (known after apply)
      + listen_port      = 9345
      + load_balancer_id = (known after apply)
      + protocol         = "tcp"
      + proxyprotocol    = (known after apply)

      + health_check {
          + interval = 5
          + port     = 9345
          + protocol = "tcp"
          + retries  = 5
          + timeout  = 2
        }
    }

  # module.training-cluster.hcloud_load_balancer_target.controlplane will be created
  + resource "hcloud_load_balancer_target" "controlplane" {
      + id               = (known after apply)
      + label_selector   = "cluster=test,controlplane=true"
      + load_balancer_id = (known after apply)
      + type             = "label_selector"
      + use_private_ip   = true
    }

  # module.training-cluster.hcloud_network.network will be created
  + resource "hcloud_network" "network" {
      + delete_protection = false
      + id                = (known after apply)
      + ip_range          = "10.0.0.0/8"
      + name              = "test"
    }

  # module.training-cluster.hcloud_network_subnet.subnet will be created
  + resource "hcloud_network_subnet" "subnet" {
      + gateway      = (known after apply)
      + id           = (known after apply)
      + ip_range     = "10.0.0.0/24"
      + network_id   = (known after apply)
      + network_zone = "eu-central"
      + type         = "cloud"
    }

  # module.training-cluster.hcloud_placement_group.controlplane will be created
  + resource "hcloud_placement_group" "controlplane" {
      + id      = (known after apply)
      + labels  = {
          + "cluster"      = "test"
          + "controlplane" = "true"
        }
      + name    = "controlplane-test"
      + servers = (known after apply)
      + type    = "spread"
    }

  # module.training-cluster.hcloud_server.controlplane[0] will be created
  + resource "hcloud_server" "controlplane" {
      + allow_deprecated_images    = false
      + backup_window              = (known after apply)
      + backups                    = false
      + datacenter                 = (known after apply)
      + delete_protection          = false
      + firewall_ids               = (known after apply)
      + id                         = (known after apply)
      + ignore_remote_firewall_ids = false
      + image                      = "ubuntu-22.04"
      + ipv4_address               = (known after apply)
      + ipv6_address               = (known after apply)
      + ipv6_network               = (known after apply)
      + keep_disk                  = false
      + labels                     = {
          + "cluster"      = "test"
          + "controlplane" = "true"
        }
      + location                   = "nbg1"
      + name                       = "test-controlplane-0"
      + placement_group_id         = (known after apply)
      + rebuild_protection         = false
      + server_type                = "cpx31"
      + ssh_keys                   = [
          + "terraform-test",
        ]
      + status                     = (known after apply)
      + user_data                  = (sensitive value)
    }

  # module.training-cluster.hcloud_server.controlplane[1] will be created
  + resource "hcloud_server" "controlplane" {
      + allow_deprecated_images    = false
      + backup_window              = (known after apply)
      + backups                    = false
      + datacenter                 = (known after apply)
      + delete_protection          = false
      + firewall_ids               = (known after apply)
      + id                         = (known after apply)
      + ignore_remote_firewall_ids = false
      + image                      = "ubuntu-22.04"
      + ipv4_address               = (known after apply)
      + ipv6_address               = (known after apply)
      + ipv6_network               = (known after apply)
      + keep_disk                  = false
      + labels                     = {
          + "cluster"      = "test"
          + "controlplane" = "true"
        }
      + location                   = "nbg1"
      + name                       = "test-controlplane-1"
      + placement_group_id         = (known after apply)
      + rebuild_protection         = false
      + server_type                = "cpx31"
      + ssh_keys                   = [
          + "terraform-test",
        ]
      + status                     = (known after apply)
      + user_data                  = (sensitive value)
    }

  # module.training-cluster.hcloud_server.controlplane[2] will be created
  + resource "hcloud_server" "controlplane" {
      + allow_deprecated_images    = false
      + backup_window              = (known after apply)
      + backups                    = false
      + datacenter                 = (known after apply)
      + delete_protection          = false
      + firewall_ids               = (known after apply)
      + id                         = (known after apply)
      + ignore_remote_firewall_ids = false
      + image                      = "ubuntu-22.04"
      + ipv4_address               = (known after apply)
      + ipv6_address               = (known after apply)
      + ipv6_network               = (known after apply)
      + keep_disk                  = false
      + labels                     = {
          + "cluster"      = "test"
          + "controlplane" = "true"
        }
      + location                   = "nbg1"
      + name                       = "test-controlplane-2"
      + placement_group_id         = (known after apply)
      + rebuild_protection         = false
      + server_type                = "cpx31"
      + ssh_keys                   = [
          + "terraform-test",
        ]
      + status                     = (known after apply)
      + user_data                  = (sensitive value)
    }

  # module.training-cluster.hcloud_server.worker[0] will be created
  + resource "hcloud_server" "worker" {
      + allow_deprecated_images    = false
      + backup_window              = (known after apply)
      + backups                    = false
      + datacenter                 = (known after apply)
      + delete_protection          = false
      + firewall_ids               = (known after apply)
      + id                         = (known after apply)
      + ignore_remote_firewall_ids = false
      + image                      = "ubuntu-22.04"
      + ipv4_address               = (known after apply)
      + ipv6_address               = (known after apply)
      + ipv6_network               = (known after apply)
      + keep_disk                  = false
      + labels                     = {
          + "cluster" = "test"
          + "worker"  = "true"
        }
      + location                   = "nbg1"
      + name                       = "test-worker-0"
      + rebuild_protection         = false
      + server_type                = "cpx41"
      + ssh_keys                   = [
          + "terraform-test",
        ]
      + status                     = (known after apply)
      + user_data                  = (sensitive value)
    }

  # module.training-cluster.hcloud_server.worker[1] will be created
  + resource "hcloud_server" "worker" {
      + allow_deprecated_images    = false
      + backup_window              = (known after apply)
      + backups                    = false
      + datacenter                 = (known after apply)
      + delete_protection          = false
      + firewall_ids               = (known after apply)
      + id                         = (known after apply)
      + ignore_remote_firewall_ids = false
      + image                      = "ubuntu-22.04"
      + ipv4_address               = (known after apply)
      + ipv6_address               = (known after apply)
      + ipv6_network               = (known after apply)
      + keep_disk                  = false
      + labels                     = {
          + "cluster" = "test"
          + "worker"  = "true"
        }
      + location                   = "nbg1"
      + name                       = "test-worker-1"
      + rebuild_protection         = false
      + server_type                = "cpx41"
      + ssh_keys                   = [
          + "terraform-test",
        ]
      + status                     = (known after apply)
      + user_data                  = (sensitive value)
    }

  # module.training-cluster.hcloud_server_network.controlplane[0] will be created
  + resource "hcloud_server_network" "controlplane" {
      + id          = (known after apply)
      + ip          = (known after apply)
      + mac_address = (known after apply)
      + network_id  = (known after apply)
      + server_id   = (known after apply)
    }

  # module.training-cluster.hcloud_server_network.controlplane[1] will be created
  + resource "hcloud_server_network" "controlplane" {
      + id          = (known after apply)
      + ip          = (known after apply)
      + mac_address = (known after apply)
      + network_id  = (known after apply)
      + server_id   = (known after apply)
    }

  # module.training-cluster.hcloud_server_network.controlplane[2] will be created
  + resource "hcloud_server_network" "controlplane" {
      + id          = (known after apply)
      + ip          = (known after apply)
      + mac_address = (known after apply)
      + network_id  = (known after apply)
      + server_id   = (known after apply)
    }

  # module.training-cluster.hcloud_server_network.worker[0] will be created
  + resource "hcloud_server_network" "worker" {
      + id          = (known after apply)
      + ip          = (known after apply)
      + mac_address = (known after apply)
      + network_id  = (known after apply)
      + server_id   = (known after apply)
    }

  # module.training-cluster.hcloud_server_network.worker[1] will be created
  + resource "hcloud_server_network" "worker" {
      + id          = (known after apply)
      + ip          = (known after apply)
      + mac_address = (known after apply)
      + network_id  = (known after apply)
      + server_id   = (known after apply)
    }

  # module.training-cluster.hcloud_ssh_key.terraform will be created
  + resource "hcloud_ssh_key" "terraform" {
      + fingerprint = (known after apply)
      + id          = (known after apply)
      + name        = "terraform-test"
      + public_key  = (known after apply)
    }

  # module.training-cluster.helm_release.certmanager will be created
  + resource "helm_release" "certmanager" {
      + atomic                     = false
      + chart                      = "cert-manager"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "certmanager"
      + namespace                  = "cert-manager"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://charts.jetstack.io"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "v1.11.0"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "ingressShim.defaultIssuerKind"
          + value = "ClusterIssuer"
        }
      + set {
          + name  = "ingressShim.defaultIssuerName"
          + value = "letsencrypt-prod"
        }
      + set {
          + name  = "installCRDs"
          + value = "true"
        }
    }

  # module.training-cluster.helm_release.certmanager-webhook-hosttech will be created
  + resource "helm_release" "certmanager-webhook-hosttech" {
      + atomic                     = false
      + chart                      = "cert-manager-webhook-hosttech"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "cert-manager-webhook-hosttech"
      + namespace                  = "cert-manager"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://piccobit.github.io/helm-charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "0.3.0"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "certManager.serviceAccountName"
          + value = "certmanager-cert-manager"
        }
      + set {
          + name  = "groupName"
          + value = "acme.acend.ch"
        }
    }

  # module.training-cluster.helm_release.cluster-autoscaler will be created
  + resource "helm_release" "cluster-autoscaler" {
      + atomic                     = false
      + chart                      = "cluster-autoscaler"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "cluster-autoscaler"
      + namespace                  = "kube-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://kubernetes.github.io/autoscaler"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                cloudProvider: hetzner
                
                autoscalingGroups:
                  - name: CPX41:NBG1:acend-test-pool1
                    maxSize: 10
                    minSize: 0
                
                
                extraEnv:
                  HCLOUD_SSH_KEY: "terraform" # generated in terraform, more keys are added in the cloudinit file
                  HCLOUD_IMAGE: "ubuntu-22.04"
                
                extraArgs:
                  write-status-configmap: true
                  scan-interval: 60s
                
                
                extraEnvSecrets:
                  HCLOUD_TOKEN:
                    name: hcloud
                    key: token
                  HCLOUD_NETWORK:
                    name: hcloud
                    key: network
                  HCLOUD_CLOUD_INIT:
                     name: cloud-init-worker # Generated from terraform with the same cloudinit as worker generated by terraform
                     key: cloudinit.yaml 
                
                
                nodeSelector:
                  node-role.kubernetes.io/control-plane: "true"
                tolerations:
                - key: "node-role.kubernetes.io/control-plane"
                  operator: "Exists"
                  effect: "NoSchedule"
            EOT,
        ]
      + verify                     = false
      + version                    = "9.25.0"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.training-cluster.helm_release.hcloud-csi-driver will be created
  + resource "helm_release" "hcloud-csi-driver" {
      + atomic                     = false
      + chart                      = "hcloud-csi-driver"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "hcloud-csi-driver"
      + namespace                  = "kube-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://helm-charts.mlohr.com/"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "2.2.1"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "secret.existingSecretName"
          + value = "hcloud"
        }
    }

  # module.training-cluster.helm_release.ingress-nginx will be created
  + resource "helm_release" "ingress-nginx" {
      + atomic                     = false
      + chart                      = "ingress-nginx"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "ingress-nginx"
      + namespace                  = "ingress-nginx"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://kubernetes.github.io/ingress-nginx"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "4.5.2"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "controller.extraArgs.default-ssl-certificate"
          + value = "cert-manager/acend-wildcard"
        }
      + set {
          + name  = "controller.ingressClassResource.default"
          + value = "true"
        }
      + set {
          + name  = "controller.replicaCount"
          + value = "2"
        }
    }

  # module.training-cluster.helm_release.kubed will be created
  + resource "helm_release" "kubed" {
      + atomic                     = false
      + chart                      = "config-syncer"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "config-syncer"
      + namespace                  = "kube-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://charts.appscode.com/stable/"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "v0.14.0-rc.0"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.training-cluster.k8s_cert_manager_io_certificate_v1.certificate-acend-wildcard will be created
  + resource "k8s_cert_manager_io_certificate_v1" "certificate-acend-wildcard" {
      + api_version = (known after apply)
      + id          = (known after apply)
      + kind        = (known after apply)
      + metadata    = {
          + name      = "acend-wildcard"
          + namespace = "cert-manager"
        }
      + spec        = {
          + dns_names   = [
              + "*.test.labcluster.acend.ch",
            ]
          + issuer_ref  = {
              + kind = "ClusterIssuer"
              + name = "letsencrypt-prod-acend"
            }
          + secret_name = "acend-wildcard"
        }
      + yaml        = (known after apply)
    }

  # module.training-cluster.k8s_cert_manager_io_cluster_issuer_v1.clusterissuer-acend-hosttech will be created
  + resource "k8s_cert_manager_io_cluster_issuer_v1" "clusterissuer-acend-hosttech" {
      + api_version = (known after apply)
      + id          = (known after apply)
      + kind        = (known after apply)
      + metadata    = {
          + name = "letsencrypt-prod-acend"
        }
      + spec        = {
          + acme = {
              + email                  = "sebastian@acend.ch"
              + private_key_secret_ref = {
                  + name = "letsencrypt-prod-acend"
                }
              + server                 = "https://acme-v02.api.letsencrypt.org/directory"
              + solvers                = [
                  + {
                      + dns01    = {
                          + webhook = {
                              + config      = {
                                  + apiUrl     = "https://api.ns1.hosttech.eu/api/user/v1"
                                  + secretName = "hosttech-secret"
                                }
                              + group_name  = "acme.acend.ch"
                              + solver_name = "hosttech"
                            }
                        }
                      + selector = {}
                    },
                ]
            }
        }
      + yaml        = (known after apply)
    }

  # module.training-cluster.k8s_cert_manager_io_cluster_issuer_v1.clusterissuer-letsencrypt-prod will be created
  + resource "k8s_cert_manager_io_cluster_issuer_v1" "clusterissuer-letsencrypt-prod" {
      + api_version = (known after apply)
      + id          = (known after apply)
      + kind        = (known after apply)
      + metadata    = {
          + name = "letsencrypt-prod"
        }
      + spec        = {
          + acme = {
              + email                  = "sebastian@acend.ch"
              + private_key_secret_ref = {
                  + name = "letsencrypt-prod"
                }
              + server                 = "https://acme-v02.api.letsencrypt.org/directory"
              + solvers                = [
                  + {
                      + http01 = {
                          + ingress = {
                              + class = "nginx"
                            }
                        }
                    },
                ]
            }
        }
      + yaml        = (known after apply)
    }

  # module.training-cluster.k8s_manifest.certificate-acend-wildcard will be created
  + resource "k8s_manifest" "certificate-acend-wildcard" {
      + content = (known after apply)
      + id      = (known after apply)
    }

  # module.training-cluster.k8s_manifest.clusterissuer-acend-hosttech will be created
  + resource "k8s_manifest" "clusterissuer-acend-hosttech" {
      + content = (known after apply)
      + id      = (known after apply)
    }

  # module.training-cluster.k8s_manifest.clusterissuer-letsencrypt-prod will be created
  + resource "k8s_manifest" "clusterissuer-letsencrypt-prod" {
      + content = (known after apply)
      + id      = (known after apply)
    }

  # module.training-cluster.kubernetes_cluster_role_binding.cloud-controller-manager will be created
  + resource "kubernetes_cluster_role_binding" "cloud-controller-manager" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "system:cloud-controller-manager"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + role_ref {
          + api_group = "rbac.authorization.k8s.io"
          + kind      = "ClusterRole"
          + name      = "cluster-admin"
        }

      + subject {
          + api_group = (known after apply)
          + kind      = "ServiceAccount"
          + name      = "cloud-controller-manager"
          + namespace = "kube-system"
        }
    }

  # module.training-cluster.kubernetes_deployment.cloud-controller-manager will be created
  + resource "kubernetes_deployment" "cloud-controller-manager" {
      + id               = (known after apply)
      + wait_for_rollout = true

      + metadata {
          + generation       = (known after apply)
          + name             = "hcloud-cloud-controller-manager"
          + namespace        = "kube-system"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + min_ready_seconds         = 0
          + paused                    = false
          + progress_deadline_seconds = 600
          + replicas                  = "1"
          + revision_history_limit    = 10

          + selector {
              + match_labels = {
                  + "app" = "hcloud-cloud-controller-manager"
                }
            }

          + template {
              + metadata {
                  + generation       = (known after apply)
                  + labels           = {
                      + "app" = "hcloud-cloud-controller-manager"
                    }
                  + name             = (known after apply)
                  + resource_version = (known after apply)
                  + uid              = (known after apply)
                }
              + spec {
                  + automount_service_account_token  = true
                  + dns_policy                       = "Default"
                  + enable_service_links             = true
                  + host_ipc                         = false
                  + host_network                     = true
                  + host_pid                         = false
                  + hostname                         = (known after apply)
                  + node_name                        = (known after apply)
                  + priority_class_name              = "system-cluster-critical"
                  + restart_policy                   = "Always"
                  + scheduler_name                   = (known after apply)
                  + service_account_name             = "cloud-controller-manager"
                  + share_process_namespace          = false
                  + termination_grace_period_seconds = 30

                  + container {
                      + command                    = [
                          + "/bin/hcloud-cloud-controller-manager",
                          + "--cloud-provider=hcloud",
                          + "--leader-elect=false",
                          + "--allow-untagged-cloud",
                          + "--allocate-node-cidrs=true",
                          + "--cluster-cidr=10.244.0.0/16",
                        ]
                      + image                      = "hetznercloud/hcloud-cloud-controller-manager:v1.14.2"
                      + image_pull_policy          = (known after apply)
                      + name                       = "hcloud-cloud-controller-manager"
                      + stdin                      = false
                      + stdin_once                 = false
                      + termination_message_path   = "/dev/termination-log"
                      + termination_message_policy = (known after apply)
                      + tty                        = false

                      + env {
                          + name = "NODE_NAME"

                          + value_from {
                              + field_ref {
                                  + api_version = "v1"
                                  + field_path  = "spec.nodeName"
                                }
                            }
                        }
                      + env {
                          + name = "HCLOUD_TOKEN"

                          + value_from {
                              + secret_key_ref {
                                  + key  = "token"
                                  + name = "hcloud"
                                }
                            }
                        }
                      + env {
                          + name = "HCLOUD_NETWORK"

                          + value_from {
                              + secret_key_ref {
                                  + key  = "network"
                                  + name = "hcloud"
                                }
                            }
                        }
                      + env {
                          + name  = "HCLOUD_LOAD_BALANCERS_NETWORK_ZONE"
                          + value = "eu-central"
                        }
                      + env {
                          + name  = "HCLOUD_LOAD_BALANCERS_USE_PRIVATE_IP"
                          + value = "true"
                        }

                      + resources {
                          + limits   = (known after apply)
                          + requests = {
                              + "cpu"    = "100m"
                              + "memory" = "50Mi"
                            }
                        }
                    }

                  + toleration {
                      + effect   = "NoSchedule"
                      + key      = "node.cloudprovider.kubernetes.io/uninitialized"
                      + operator = "Equal"
                      + value    = "true"
                    }
                  + toleration {
                      + key      = "CriticalAddonsOnly"
                      + operator = "Exists"
                    }
                  + toleration {
                      + effect   = "NoSchedule"
                      + key      = "node-role.kubernetes.io/control-plane"
                      + operator = "Equal"
                      + value    = "true"
                    }
                  + toleration {
                      + effect   = "NoSchedule"
                      + key      = "node-role.kubernetes.io/master"
                      + operator = "Equal"
                      + value    = "true"
                    }
                  + toleration {
                      + effect   = "NoSchedule"
                      + key      = "node.kubernetes.io/not-ready"
                      + operator = "Equal"
                      + value    = "true"
                    }
                }
            }
        }
    }

  # module.training-cluster.kubernetes_namespace.cert-manager will be created
  + resource "kubernetes_namespace" "cert-manager" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "cert-manager"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.training-cluster.kubernetes_namespace.ingress-nginx will be created
  + resource "kubernetes_namespace" "ingress-nginx" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "ingress-nginx"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.training-cluster.kubernetes_secret.cloud-controller-manager will be created
  + resource "kubernetes_secret" "cloud-controller-manager" {
      + data                           = (sensitive value)
      + id                             = (known after apply)
      + type                           = "Opaque"
      + wait_for_service_account_token = true

      + metadata {
          + generation       = (known after apply)
          + name             = "cloud-controller-manager"
          + namespace        = "default"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.training-cluster.kubernetes_secret.cloud_init_worker will be created
  + resource "kubernetes_secret" "cloud_init_worker" {
      + data                           = (sensitive value)
      + id                             = (known after apply)
      + type                           = "Opaque"
      + wait_for_service_account_token = true

      + metadata {
          + generation       = (known after apply)
          + name             = "cloud-init-worker"
          + namespace        = "kube-system"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.training-cluster.kubernetes_secret.hcloud will be created
  + resource "kubernetes_secret" "hcloud" {
      + data                           = (sensitive value)
      + id                             = (known after apply)
      + type                           = "Opaque"
      + wait_for_service_account_token = true

      + metadata {
          + generation       = (known after apply)
          + name             = "hcloud"
          + namespace        = "kube-system"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.training-cluster.kubernetes_secret.hosttech-secret will be created
  + resource "kubernetes_secret" "hosttech-secret" {
      + data                           = (sensitive value)
      + id                             = (known after apply)
      + type                           = "Opaque"
      + wait_for_service_account_token = true

      + metadata {
          + generation       = (known after apply)
          + name             = "hosttech-secret"
          + namespace        = "cert-manager"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.training-cluster.kubernetes_service_account.cloud-controller-manager will be created
  + resource "kubernetes_service_account" "cloud-controller-manager" {
      + automount_service_account_token = true
      + default_secret_name             = (known after apply)
      + id                              = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "cloud-controller-manager"
          + namespace        = "kube-system"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + secret {
          + name = "cloud-controller-manager"
        }
    }

  # module.training-cluster.null_resource.cleanup-node-before-destroy[0] will be created
  + resource "null_resource" "cleanup-node-before-destroy" {
      + id       = (known after apply)
      + triggers = {
          + "node_name" = "test-worker-0"
        }
    }

  # module.training-cluster.null_resource.cleanup-node-before-destroy[1] will be created
  + resource "null_resource" "cleanup-node-before-destroy" {
      + id       = (known after apply)
      + triggers = {
          + "node_name" = "test-worker-1"
        }
    }

  # module.training-cluster.null_resource.wait_for_k8s_api will be created
  + resource "null_resource" "wait_for_k8s_api" {
      + id       = (known after apply)
      + triggers = {}
    }

  # module.training-cluster.random_password.rke2_cluster_secret will be created
  + resource "random_password" "rke2_cluster_secret" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 256
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # module.training-cluster.restapi_object.api-a-record will be created
  + resource "restapi_object" "api-a-record" {
      + api_data        = (known after apply)
      + api_response    = (known after apply)
      + create_response = (known after apply)
      + data            = (known after apply)
      + id              = (known after apply)
      + id_attribute    = "data/id"
      + path            = "/api/user/v1/zones/242898/records"
    }

  # module.training-cluster.restapi_object.api-aaaa-record will be created
  + resource "restapi_object" "api-aaaa-record" {
      + api_data        = (known after apply)
      + api_response    = (known after apply)
      + create_response = (known after apply)
      + data            = (known after apply)
      + id              = (known after apply)
      + id_attribute    = "data/id"
      + path            = "/api/user/v1/zones/242898/records"
    }

  # module.training-cluster.restapi_object.labapp-a-record will be created
  + resource "restapi_object" "labapp-a-record" {
      + api_data        = (known after apply)
      + api_response    = (known after apply)
      + create_response = (known after apply)
      + data            = (known after apply)
      + id              = (known after apply)
      + id_attribute    = "data/id"
      + path            = "/api/user/v1/zones/242898/records"
    }

  # module.training-cluster.restapi_object.labapp-aaaa-record will be created
  + resource "restapi_object" "labapp-aaaa-record" {
      + api_data        = (known after apply)
      + api_response    = (known after apply)
      + create_response = (known after apply)
      + data            = (known after apply)
      + id              = (known after apply)
      + id_attribute    = "data/id"
      + path            = "/api/user/v1/zones/242898/records"
    }

  # module.training-cluster.ssh_resource.getkubeconfig will be created
  + resource "ssh_resource" "getkubeconfig" {
      + agent                       = false
      + bastion_port                = "22"
      + commands                    = [
          + "until [ -f /etc/rancher/rke2/rke2.yaml ]; do sleep 10; done;",
          + "cat /etc/rancher/rke2/rke2.yaml",
        ]
      + commands_after_file_changes = true
      + host                        = (known after apply)
      + id                          = (known after apply)
      + port                        = "22"
      + private_key                 = (sensitive value)
      + result                      = (known after apply)
      + retry_delay                 = "5s"
      + timeout                     = "15m"
      + user                        = "root"
      + when                        = "create"
    }

  # module.training-cluster.time_sleep.wait_for_cluster_ready will be created
  + resource "time_sleep" "wait_for_cluster_ready" {
      + create_duration = "30s"
      + id              = (known after apply)
    }

  # module.training-cluster.tls_private_key.terraform will be created
  + resource "tls_private_key" "terraform" {
      + algorithm                     = "ECDSA"
      + ecdsa_curve                   = "P384"
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + private_key_pem               = (sensitive value)
      + private_key_pem_pkcs8         = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
      + rsa_bits                      = 2048
    }

Plan: 52 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @splattner, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*